stress-test.yaml
config:
  target: 'http://localhost:8080'
  phases:
    # 부하 시작 전 예열 (Warm up)
    - duration: 10
      arrivalRate: 38
      name: Warm up - 1

      # 부하 시작
    - duration: 30
      arrivalRate: 10
      rampTo: 375
      name: Burst Load - 2(점점 트래픽 증가)
      # 부하 유지
    - duration: 30
      arrivalRate: 375
      name: Sustained Load - 3
      # 부하를 점점 줄이기
    - duration: 20
      arrivalRate: 38
      rampTo: 50
      name: End of load - 4

scenarios:
  - flow:
      - get:
          url: "/api/kimchi?kimchi-name=네고왕김치"
          headers:
            authorization: 'Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJzdWIiOiJBY2Nlc3NUb2tlbiIsInN1YmplY3QiOiJKSVdPTkBuYXZlci5jb20iLCJleHAiOjE4MTYxODQ4MTN9.vdUUWrXAASsbvJpJJv-cQ5W2PgAaQNLO5rbNHvx2rR88vlHwSuhNQpDQgb3xkwQtnqUfST0vJM018duPHv6RYQ'